Revit 2027 API
GlazingTransmittanceColorType Enumeration
 The enumerated type representing the permitted values for the asset property "GlazingTransmittanceColor" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GlazingTransmittanceColorType
Public Enumeration GlazingTransmittanceColorType
public enum class GlazingTransmittanceColorType
type GlazingTransmittanceColorType
Members
Member name | Value | Description
Blue | 3
Bluegreen | 4
Bronze | 5
Clear | 0
Custom | 6
Gray | 2
Green | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace